export interface DeclarationType {
  code: string;
  type: string;
  name: string;
  npa?: string;
}

export const declarationTypes: DeclarationType[] = [
  { code: '10', type: 'ЭК', name: 'Экспорт', npa: 'ТК ст. 29' },
  { code: '11', type: 'ЭК', name: 'Реэкспорт', npa: 'ТК ст. 32' },
  { code: '12', type: 'ЭК', name: 'Временный вывоз', npa: 'ТК ст. 36' },
  { code: '40', type: 'ИМ', name: 'Выпуск для свободного обращения (импорт)', npa: 'ТК ст. 55' },
  { code: '41', type: 'ИМ', name: 'Реимпорт', npa: 'ТК ст. 58' },
  { code: '42', type: 'ИМ', name: 'Временный ввоз', npa: 'ТК ст. 61' },
  { code: '51', type: 'ИМ', name: 'Переработка на таможенной территории', npa: 'ТК ст. 70' },
  { code: '51', type: 'ЭК', name: 'Переработка на таможенной территории', npa: 'ТК ст. 70' },
  { code: '61', type: 'ЭК', name: 'Переработка вне таможенной территории', npa: 'ТК ст. 42' },
  { code: '61', type: 'ИМ', name: 'Переработка вне таможенной территории', npa: 'ТК ст. 42' },
  { code: '70', type: 'ИМ', name: 'Временное хранение', npa: 'ТК ст. 83' },
  { code: '71', type: 'ИМ', name: 'Свободная таможенная зона', npa: 'ТК ст. 106' },
  { code: '71', type: 'ЭК', name: 'Свободная таможенная зона', npa: 'ТК ст. 106' },
  { code: '72', type: 'ИМ', name: 'Беспошлинная торговля', npa: 'ТК ст. 174' },
  { code: '72', type: 'ЭК', name: 'Беспошлинная торговля', npa: 'ТК ст. 174' },
  { code: '73', type: 'ИМ', name: 'Свободный склад', npa: 'ТК ст. 100' },
  { code: '73', type: 'ЭК', name: 'Свободный склад', npa: 'ТК ст. 100' },
  { code: '74', type: 'ИМ', name: 'Таможенный склад', npa: 'ТК ст. 90' },
  { code: '74', type: 'ЭК', name: 'Таможенный склад', npa: 'ТК ст. 90' },
  { code: '75', type: 'ИМ', name: 'Отказ в пользу государства', npa: 'ТК ст. 128' },
  { code: '75', type: 'ЭК', name: 'Отказ в пользу государства', npa: 'ТК ст. 128' },
  { code: '76', type: 'ИМ', name: 'Уничтожение', npa: 'ТК ст. 121' },
  { code: '80', type: 'ТР', name: 'Транзит', npa: 'ТК ст. 116' },
  { code: '40', type: 'НД', name: 'Неполная декларация', npa: 'ТК ст. 269' },
  { code: '40', type: 'ПР', name: 'Предварительная декларация', npa: 'ТК ст. 262' },
  { code: '40', type: 'ПЕ', name: 'Периодическая декларация', npa: 'ТК ст. 270' },
  { code: '40', type: 'ВД', name: 'Временная декларация', npa: 'ТК ст. 268' },
  { code: '10', type: 'ВД', name: 'Временная декларация', npa: 'ТК ст. 268' },
  { code: '74', type: 'ВД', name: 'Таможенный склад', npa: 'ТК ст. 90' },
];
